Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If any element of LIST is an lvalue, you can modify it by modifying VAR inside the loop.
es_es: Si cualquier elemento de LISTA es un I<lvalue> (un valor que puede ponerse en el lado izquierdo de una expresión de asignación), puede modificarlo, modificando VAR dentro del bucle.

source: W An unsigned char value (can be greater than 255).
es_es: W Un valor de un carácter sin signo (puede ser mayor de 255).

source: Now F<malloc.h> is not used.
es_es: Ahora ya no se utiliza F<malloc.h>.

source: d Delete found but unreplaced characters.
es_es: d Elimina los caracteres que se encuentren pero que no hayan sido reemplazados.

source: %hash = map { +"\L$_" => 1 } @array # perl guesses BLOCK.
es_es: %hash = map { +"\L$_" => 1 } @array # perl lee bien el BLOQUE.

source: To avoid the possibility of miscoordination, Perl now flushes FILEHANDLE before locking or unlocking it.
es_es: Para evitar la posibilidad de descoordinación, Perl ahora vacía el IDENTIFICADOR_ARCHIVO antes de bloquearlo o desbloquearlo.

source: Example:
es_es: Ejemplo:

source: # now process $_
es_es: # ahora, procesa $_

source: See L<perliol> for detailed info on PerlIO.
es_es: Ver L<perliol> para información detallada sobre PerlIO.

source: Starting with 5.9.4, they'll be always loaded if they exist.
es_es: A partir de 5.9.4, siempre serán cargados, si existen.

source: In scalar context, each execution of C<m//g> finds the next match, returning true if it matches, and false if there is no further match.
es_es: En contexto escalar, cada ejecución de C<m//g> encuentra la siguiente coincidencia, devolviendo verdadero si coincide, y falso si no hay ninguna coincidencia más.

source: by James Lee
es_es: James Lee

source: If you really want to write these, include them as sub-documents such as C<My::Module::Tutorial> or C<My::Module::FAQ> and provide a link in the SEE ALSO section of the main documentation.
es_es: Si realmente quieres escribirlos, inclúyalos como sub-documentos, tales como C<My::Module::Tutorial> o C<My::Module::FAQ> y proporcione un enlace en la sección VEA TAMBIÉN de la documentación principal.

source: %hash = map { ("\L$_" => 1) } @array # this also works
es_es: %hash = map { ("\L$_" => 1) } @array # esto también funciona

source: The C<BEGIN> forces the C<require> and C<import> to happen at compile time.
es_es: El C<BEGIN> fuerza a ejecutar a C<require> e C<import> en tiempo de compilación.

source: These new warnings are now emitted when a dirhandle is used but is either closed or not really a dirhandle.
es_es: Estas nuevas advertencias son ahora emitidas cuando un identificador de directorio que es usado ya está cerrado o no es realmente un identificador de directorio.

source: =item exec LIST
es_es: =item exec LISTA

source: $ARRAY[++$#ARRAY] = $value;
es_es: $ARRAY[++$#ARRAY] = $valor;

source: Leading whitespace is ignored in all three cases.) The following will handle decimal, binary, octal, and hex in standard Perl notation:
es_es: El espacio en blanco que le rodea es ignorado en los tres casos). Lo que le sigue se interpretará como un decimal, binario, octal y hexadecimal en la notación estándar de Perl:

source: You must ensure your strings don't exceed this limit after any necessary interpolations.
es_es: Debe asegurarse de que sus cadenas de texto no superan ese límite después de cualquier necesaria interpolación.

source: FETCH this,
es_es: FETCH este,

source: $mode = "0644"; chmod oct($mode), "foo"; # this is better
es_es: $modo = "0644"; chmod oct($modo), "foo"; # este es mejor

source: (Note that this is not true of lists, which return the last value, like the C comma operator, nor of built-in functions, which return whatever they feel like returning.) The following is always true: X<array, length>
es_es: (Note que esto no es cierto para las listas, que devuelven el último valor, como el operador coma de C, y tampoco para las funciones integradas, que devuelven lo que les parezca mejor devolver). Lo siguiente es siempre verdadero: X<array, length> X<array, longitud>

source: This is useful with sockets when you want to tell the other side you're done writing but not done reading, or vice versa.
es_es: Esto es útil con sockets cuando desee decirle al otro lado que ha terminado de escribir, pero no ha terminado la lectura, o viceversa.

# print "The price is $Price. "; # interpolated
source: print "The price is $Price.\n"; # interpolated
es_es: print "El precio es $Precio.\n"; # interpolado

source: @many = glob "{apple,tomato,cherry}={green,yellow,red}";
es_es: @muchos = glob "{manzana,tomate,cereza}={verde,amarilla,roja}";

source: See L<perlfunc/do>.
es_es: Ver L<perlfunc/do>.

source: These routines are the same as their counterparts in the system C library.
es_es: Estas rutinas son las mismas que sus homólogas en la biblioteca del sistema.

source: In those cases the value of EXPR is used directly as a boolean.
es_es: En estos casos el valor de EXPR es usado directamente como un booleano.

source: Because Perl doesn't look ahead for the closing C<}> it has to take a guess at which it's dealing with based on what it finds just after the C<{>.
es_es: Debido a que Perl no mira por adelantado por el cierre C<}>, tiene que hacer una conjetura por la que tiene que lidiar en base a lo que encuentra justo después de la <C{>.

source: wh.space
es_es: espacios en blanco

source: As an alternative, overloaded constants (see L<overload>) provide a simple way to extend the functionality of the RE engine, by substituting one pattern for another.
es_es: Como alternativa, las constantes sobrecargadas (vea L<overload>) proporcionan una manera sencilla de extender la funcionalidad del motor de RE, mediante la sustitución de un patrón por otro.

source: That's why it's common practice to include alternatives in parentheses: to minimize confusion about where they start and end.
es_es: Es por eso que es una práctica común incluir las alternativas entre paréntesis: para minimizar la confusión acerca de dónde empiezan y terminan.

source: C<~~> will now refuse to work on objects that do not overload it (in order to avoid relying on the object's underlying structure).
es_es: C<~~> rechazará funcionar en objetos que no lo sobrecarguen (para no depender de la estructura subyacente del objeto)

source: Closing a pipe also waits for the process executing on the pipe to exit--in case you wish to look at the output of the pipe afterwards--and implicitly puts the exit status value of that command into C<$?> and C<${^CHILD_ERROR_NATIVE}>.
es_es: El proceso de cierre de una tubería también espera por el proceso de ejecución en la tubería antes de salir -en caso de que desee ver después la salida de la tubería- e, implícitamente, pone el valor de estado de salida de ese comando en C<$?> y C<${^CHILD_ERROR_NATIVE}>.

source: C<Test::Simple> upgraded to version 0.62 (was 0.54)
es_es: C<Test::Simple> actualizado a la versión 0.62 (era 0.54)

source: =head2 Calling CORE::require()
es_es: =head2 Llamando a CORE::require()

source: foreach (@fruits) {
es_es: foreach (@frutas) {

# print "Can do. " if -r $a || -w _ || -x _;
source: print "Can do.\n" if -r $a || -w _ || -x _;
es_es: print "Puedo hacerlo.\n" if -r $a || -w _ || -x _;

source: # expand tabs to 8-column spacing
es_es: # expandir tabuladores a un espaciado de 8 columnas

source: The C<-T> and C<-B> switches work as follows.
es_es: Las opciones C<-T> y C<-B> funcionan como sigue.

source: When presented with something that might have several different interpretations, Perl uses the B<DWIM> (that's "Do What I Mean") principle to pick the most probable interpretation.
es_es: Cuando se le presenta algo que podría tener varias interpretaciones diferentes, Perl utiliza el B<DWIM> ("I<Do What I Mean>", es decir, "hacer lo que quiero decir") para escoger la interpretación más probable.

source: Upgraded from version 1.04 to 1.05.
es_es: Actualizado desde la versión 1.04 a la 1.05.

source: The C<continue> block, if any, is I<not> executed.
es_es: El bloque C<continue>, si está, no es ejecutado.

source: Since it does not change semantics, details of this step are not documented and are subject to change without notice.
es_es: Ya que no cambia la semántica, los detalles de este paso no están documentados y están sujetas a cambios sin previo aviso.

source: =head2 Formats
es_es: =head2 Formatos

source: =head2 Parsing of C<-f _>
es_es: =head2 Análisis de C<-f _>

source: =head2 Parallel tests
es_es: =head2 Pruebas en paralelo

source: An exception to this is that you may assign to C<undef> in a list.
es_es: Una excepción a esto es que puede asignar C<undef> en una lista.

source: For instance, in the example above, the final C<print $y> would cause a compile-time error and prevent you from running the program.
es_es: Así, en el ejemplo anterior, la última instrucción C<print $y> provocará una error en tiempo de compilación que impedirá la ejecución del programa.

source: Hash entries are returned in an apparently random order.
es_es: Las entradas de un hash son devueltas en un aparente orden aleatorio.

source: =head2 Using Perl modules
es_es: =head2 Utilización de módulos de Perl

source: See L</Warning on \1 Instead of $1> below for details.
es_es: Vea L</Advertencia de \1 en lugar de $1> abajo para los detalles.

source: The SALT used to create the digest is visible as part of the digest.
es_es: El SALTO usado para crear el I<digest> es visible como parte del I<digest>.

source: For different quoting constructs, Perl performs different numbers of passes, from one to four, but these passes are always performed in the same order.
es_es: Para diferentes construcciones de entrecomillado, Perl realiza diferentes números de pases, de uno a cuatro, pero estos pases se realizan siempre en el mismo orden.

source: =head2 The sheet
es_es: =head2 La hoja

source: $fruit_color{"apple"}; # gives "red"
es_es: $color_fruta{"manzana"}; # devuelve "rojo"

source: That is, change "." to match any character whatsoever, even a newline, which normally it would not match.
es_es: Es decir, cambia "." para que coincida con cualquier carácter, incluso el de nueva línea, que normalmente no coincidiría.

# print "The animal is $animal ";
source: print "The animal is $animal\n";
es_es: print "El animal es $animal\n";

source: =head2 More Unicode Fixes
es_es: =head2 Más correcciones Unicode

source: This is the internal function implementing the C<qx/EXPR/> operator, but you can use it directly.
es_es: Esto es la función interna que implementa el operador C<qx/EXPR/>, pero puede usarla directamente.

source: $x = (($foo,$bar) = (3,2,1)); # set $x to 3, not 2
es_es: $x = (($foo,$bar) = (3,2,1)); # pone $x a 3, no 2

source: Array CodeRef sub truth for each elt[1] !grep { !$b->($_) } @$a
es_es: Array RefCódigo sub verdad por cada elemento[1] !grep { !$b->($_) } @$a

source: This isn't a particularly good seed, so many old programs supply their own seed value (often C<time ^ $$> or C<time ^ ($$ + ($$ << 15))>), but that isn't necessary any more.
es_es: Esto no es una buena semilla, por lo que demasiados viejos programas tienen sus propias semillas (a menudo C<time ^ $$> o C<time ^ ($$ + ($$ << 15))>), pero esto ya no es necesario.

source: (The way C<study> works is this: a linked list of every character in the string to be searched is made, so we know, for example, where all the C<'k'> characters are.
es_es: (La forma en que C<study> funciona es la siguiente: se crea una lista enlazada de todos los caracteres en la cadena que se deben buscar, así sabremos, por ejemplo, donde están todos los caracteres C<'k'>.

source: They are suspected to be compiler errors (at least the shuffle.t failure is known from some IRIX 6 setups) and math library errors (the Trig.t failure), but since IRIX 5 is long since end-of-lifed, further fixes for the IRIX are unlikely.
es_es: Son sospechosos de ser errores del compilador (por lo menos, del error de shuffle.t se sabe de algunos IRIX seis configuraciones) y los errores de la biblioteca matemática (el error de Trig.t), pero como IRIX 5 está desde hace mucho tiempo al final de su vida, son poco probables los arreglos de errores para el IRIX.

source: It used to report whether memory for that aggregate had ever been allocated.
es_es: Se usó para informar si la memoria para los datos agregados había sido reservada.

source: You can now use C<no> followed by a version number to specify that you want to use a version of perl older than the specified one.
es_es: Ahora puede utilizar C<no> seguido por un número de versión para especificar que desea utilizar una versión de Perl más vieja que la especificada.

source: perl5111delta Perl changes in version 5.11.1
es_es: perl5111delta Cambios en la versión 5.11.1

source: "f")[$num & 15];
es_es: "f")[$numero & 15];

source: my $oops = substr $name, 7; # returns undef, with warning
es_es: my $oops = substr $nombre, 7; # devuelve undef, con advertencia

source: Other layers that would affect the binary nature of the stream are I<also> disabled.
es_es: -- otras capas que pudieran afectar la naturaleza binaria del flujo son I<también> desactivadas.

source: then any bareword that would NOT be interpreted as a subroutine call produces a compile-time error instead.
es_es: entonces cualquier palabra suelta que NO pueda ser interpretada como una llamada de subrutina, produce en su lugar un error en tiempo de compilación.

source: The effect the "o" modifier has is not propagated, being restricted to those patterns explicitly using it.
es_es: El efecto del modificador "o" no es propagado, se limita a los patrones que lo utilicen de forma explícita.

source: Math::String treat string sequences like numbers
es_es: Math::String trata secuencias de cadenas como números

source: In scalar context it evaluates its left argument, throws that value away, then evaluates its right argument and returns that value.
es_es: En contexto escalar evalúa su argumento de la izquierda, descarta este valor, y luego evalúa su argumento de la derecha y devuelve este valor.

source: delete @{$ref->[$x][$y]}{$key1, $key2, @morekeys};
es_es: delete @{$ref->[$x][$y]}{$clave1, $clave2, @masclaves};

source: FETCHSIZE this
es_es: FETCHSIZE este

source: Because patterns are processed as double-quoted strings, the following also work:
es_es: Dado que los patrones son procesados como cadenas doblemente entrecomilladas, lo que sigue también funciona:

source: next LINE if (1 ..
es_es: next LINEA if (1 ..

source: $cost = <<\VISTA; # Same thing!
es_es: $cost = <<\VISTA; # ¡Lo mismo!

# end (before ) /m line based ^$
source: end (before \n) /m line based ^$
es_es: cadena (antes \n) /m basado en líneas ^$

source: On systems that support a close-on-exec flag on files, that flag is set on all newly opened file descriptors whose C<fileno>s are I<higher> than the current value of $^F (by default 2 for C<STDERR>).
es_es: En los sistemas que soportan las banderas cerrado-en-ejecución en los archivos, esas banderas se encuentran en todos los nuevos descriptores de archivos abiertos cuyo C<fileno> sean más I<altos> que el valor actual de $^F (por defecto 2 para C<STDERR>).

source: If the argument before the ? is true, the argument before the : is returned, otherwise the argument after the : is returned.
es_es: Si el argumento anterior al ? es verdadero, se devuelve el argumento anterior al ":"; de lo contrario se devuelve el argumento posterior a ":".

source: stat($filename);
es_es: stat($nombre_de_archivo);

source: C<{> starts both hash references and blocks, so C<map { ...> could be either the start of map BLOCK LIST or map EXPR, LIST.
es_es: C<{> comienza tanto una referencia a hash como bloques, por lo que C<map { ...> podría ser tanto el comienzo de map BLOQUE LISTA o map EXPR, LISTA.

source: See the Perl Mongers website ( http://www.pm.org/ ) for more information about joining, starting, or requesting services for a Perl user group.
es_es: Visite el sitio web de Perl Mongers ( http://www.pm.org/ ) para obtener más información sobre servicios relacionados con los grupos de usuarios de Perl: cómo unirse a un grupo, cómo iniciar un grupo o cómo solicitar servicios para un grupo.

source: line, it must also be used on the command line
es_es: línea, también debe estar en la línea de comandos

source: When under C<use filetest 'access'> the above-mentioned filetests test whether the permission can(not) be granted using the access(2) family of system calls.
es_es: Cuando esté bajo C<use filetest 'access'>, las comprobaciones de archivo mencionadas antes comprobarán cuándo los permisos pueden (o no) ser concedidos usando la familia de llamadas del sistema access(2).

source: my $success = 0;
es_es: my $exito = 0;

source: =item binmode FILEHANDLE
es_es: =item binmode IDENTIFICADOR_ARCHIVO

source: See L<perlipc> for an example of socketpair use.
es_es: Ver L<perlipc> para un ejemplo de uso de socketpair.

source: perlglossary - Perl Glossary
es_es: perlglossary - Glosario Perl

source: =item C<(?{ code })> X<(?{})> X<regex, code in> X<regexp, code in> X<regular expression, code in>
es_es: =item C<(?{ código })> X<(?{})> X<regex, código interior> X<regexp, código interior> X<expresión regular, código interior>

source: So for example, C<~"\x{3B1}"> is C<"\x{FFFF_FC4E}"> on 32-bit machines and C<"\x{FFFF_FFFF_FFFF_FC4E}"> on 64-bit machines.
es_es: Así, por ejemplo, C<~"\x{3B1}"> es C<"\x{FFFF_FC4E}"> en máquinas de 32 bits y C<"\x{FFFF_FFFF_FFFF_FC4E}"> en máquinas de 64 bits.

source: If BITS is 16 or more, bytes of the input string are grouped into chunks of size BITS/8, and each group is converted to a number as with pack()/unpack() with big-endian formats C<n>/C<N> (and analogously for BITS==64).
es_es: Si BITS es de 16 o más, los bytes de la cadena de entrada se agrupan en bloques de tamaño BITS/8, y cada grupo es convertido a un número como con pack()/unpack() con formatos big-endian C<n>/C<N> (Y, análogamente para BITS==64).

source: Backtracking is often optimized internally, but the general principle outlined here is valid.
es_es: La vuelta atrás es a menudo optimizada internamente, pero estos principios generales siguen siendo válidos.

source: If no string is specified via the C<=~> or C<!~> operator, the C<$_> variable is searched and modified.
es_es: Si no se especifica una cadena a través de los operadores C<=~> o C<!~>, se utiliza la variable C<$_> para la búsqueda y la modificación.

source: It's cleaner because it's less noisy.
es_es: Es más limpio porque es menos ruidoso.

source: Also shift operations internally use signed integers rather than the default unsigned.
es_es: Además, las operaciones de desplazamiento usan internamente enteros con signo en lugar de los enteros sin signo predeterminados.

source: printf '<%+d>', 12; # prints "<+12>"
es_es: printf '<%+d>', 12; # imprime "<+12>"

source: Returns like C<ioctl>: the undefined value for error, "C<0 but true>" for zero, or the actual return value otherwise.
es_es: Devuelve lo mismo que C<ioctl>: el valor indefinido para error, C<"0 but true"> para el cero, o el valor de retorno real, en caso contrario.

source: This document describes differences between the 5.003 release (as documented in I<Programming Perl>, second edition--the Camel Book) and this one.
es_es: Este documento describe las diferencias entre la versión 5.003 (como se documenta en I<Programming Perl>, segunda edición - el libro del Dromedario) y ésta.

source: (You will not be required to justify it to the Copyright Holder, but only to the computing community at large as a market that must bear the fee.)
es_es: (No se requerirá la justificación al Titular del Copyright, pero sólo a la comunidad informática en general como un mercado que debe tener la tasa).

source: In a C<< while (<>) >> loop, C<eof> or C<eof(ARGV)> can be used to detect the end of each file, whereas C<eof()> will detect the end of the very last file only.
es_es: En un bucle C<< while (<>) >>, C<eof> o C<eof(ARGV)> pueden usarse para detectar el fin de un archivo, mientras que C<eof()> sólo detectará el final del último archivo.

source: Perl is now known to build also in Hitachi HI-UXMPP.
es_es: Se sabe que Perl se compila también ahora en Hitachi HI-UXMPP.

source: The C<< <EXPR> >> operator is discussed in more detail in L<perlop/"I/O Operators">.
es_es: El operador C<< <EXPR> >> se discute con más detalle en L<perlop/"Operadores E/S">.

source: The
es_es: La versión definida es simplemente una cadena de

source: This means that code points above 255 are treated as Unicode no matter what locale is in effect.
es_es: Esto significa que los puntos de código por encima de 255 se consideran como Unicode sin importar qué configuración regional esté en vigor.

source: =head1 Platform Specific Problems
es_es: =head1 Problemas en plataformas específicas

source: This unary operator takes one argument, either a filename, a filehandle, or a dirhandle, and tests the associated file to see if something is true about it.
es_es: Este operador unario toma un argumento, bien sea un nombre de archivo o un identificador de archivo o de directorio, y comprueba si el archivo asociado para ver si algo sobre él es cierto.

source: There are three forms: C<goto>-LABEL, C<goto>-EXPR, and C<goto>-&NAME.
es_es: Existen tres formas: C<goto>-ETIQUETA, C<goto>-EXPR y C<goto>-&NOMBRE.

source: Similarly, just because an operator lets you assume default arguments doesn't mean that you have to make use of the defaults.
es_es: De forma similar, sólo porque un operador le permite asumir argumentos por defecto no significa que usted tenga que hacer uso de esos valores por defecto.

source: =head2 sort() enhancements
es_es: =head2 Mejoras en sort()

source: This is corrected in perl5.8.6.
es_es: Esto se ha corregido en perl5.8.6.

source: Until a release of these compilers is made, support for compiling Perl with these compiler experimental.
es_es: Hasta que una liberación de estos compiladores sea hecha, el soporte para la compilación de Perl con estas herramientas es experimental.

# print "Hello $_! " foreach qw(world Dolly nurse);
source: print "Hello $_!\n" foreach qw(world Dolly nurse);
es_es: print "Hola $_!\n" foreach qw(mundo Dolly enfermera);

source: ?+ Match 0 or 1 time and give nothing back
es_es: ?+ Coincide 0 o 1 veces y no devuelve nada

source: # to the variable name, and then evaluated
es_es: # al nombre de la variable, y entonces, evaluada

source: Only resets variables or searches in the current package.
es_es: Sólo se restablecen variables o búsquedas en el paquete actual.

source: CPAN is a free service and is not affiliated with O'Reilly Media.
es_es: CPAN es un servicio gratuito y no está afiliado a O'Reilly Media.

source: Some of the books we've listed appear almost ancient in internet scale, but we've included those books because they still describe the current way of doing things.
es_es: En la escala temporal de Internet, algunos de los libros de la lista parecen anticuados, pero los hemos incluido porque su contenido sigue siendo válido en la actualidad.

source: C<Attribute::Handlers> upgraded to version 0.78_02
es_es: C<Attribute::Handlers> actualizado a la versión 0.78_02

source: || warn "close failed: $!";
es_es: || warn "close falló: $!";

source: perlsyn - Perl syntax
es_es: perlsyn - Sintaxis de Perl

source: If the terminating identifier is on the last line of the program, you must be sure there is a newline after it; otherwise, Perl will give the warning B<Can't find string terminator "END" anywhere before EOF...>.
es_es: Si el identificador de final está en la última línea del programa, debe asegurarse de que hay un carácter de nueva línea después de él; de lo contrario, Perl dará la advertencia B<Can't find string terminator "END" anywhere before EOF...>.
